spec/html_code_syntax_highlight_examples/prepended-comma-coderay.html
<h1>Removing the prepended comma from Org mode src blocks</h1>
<p>As mentioned in <a href="http://orgmode.org/manual/Literal-examples.html">http://orgmode.org/manual/Literal-examples.html</a>,
  when at the beginning of the line there is either &#8220;,*&#8221; or &#8220;,#+&#8221;
  this prepended comma should be removed before parsing.</p>
<p>(Fixes <a href="https://github.com/bdewey/org-ruby/issues/50">https://github.com/bdewey/org-ruby/issues/50</a>)</p>
<h2>Here the prepended comma will be removed.</h2>
<pre class="src" lang="org">* Hello
** Goodbye
 *** Not a headline, but prepended comma still removed.
* I am a headline
</pre>
<h2>Here the prepended comma is should not be removed.</h2>
<pre class="src" lang="js">
{
  <span style="color:#606"><span style="color:#404">&quot;</span><span>one</span><span style="color:#404">&quot;</span></span>:   <span style="color:#00D">1</span>
, <span style="color:#606"><span style="color:#404">&quot;</span><span>two</span><span style="color:#404">&quot;</span></span>:   <span style="color:#00D">2</span>
, <span style="color:#606"><span style="color:#404">&quot;</span><span>three</span><span style="color:#404">&quot;</span></span>: <span style="color:#00D">3</span>
, <span style="color:#606"><span style="color:#404">&quot;</span><span>four</span><span style="color:#404">&quot;</span></span>:  <span style="color:#00D">4</span>
}
</pre>
<h2>Here the prepended comma is also removed</h2>
<p>Emacs Org mode implementation also removes it.</p>
<pre class="src" lang="ruby">
text = <span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#710">&lt;&lt;TEXT</span></span><span style="background-color:hsla(0,100%,50%,0.05)"><span style="color:#D20">
#+TITLE: Prepended comma world
* Hello world
More text here</span><span style="color:#710">
TEXT</span></span>
</pre>
<h2>Here the prepended comma will be remove for the <code>Hello world</code> headline</h2>
<pre class="src" lang="org">
,  ,* Hi
,  
,  ,* This will be appended a comma
* Hello world  
,  
</pre>
<h2>Here the prepended comma will be removed</h2>
<pre class="src" lang="org">#+TITLE: &quot;Hello world&quot;
</pre>
<h2>This will be rendered as normal</h2>
<pre class="src" lang="org">
,,,,,,,,,,,,,,,,,*Hello world
</pre>
